SPedt_!/src/Documents/ПотерянныеЗаказы/ПотерянныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПотерянныеЗаказы</name>
  <registerRecords>AccumulationRegister.ПотерянныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВопросРешен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остатки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКомментария</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоступил</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступленияЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПринятоСОпозданием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/Documents/ПотерянныеЗаказы/Forms/ФормаДокумента/Module.bsl
#Область Заполнение

&НаСервере
Процедура ЗаполнитьНаСервере()
	докОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	докОбъект.ЗаполнитьПросроченнымиЗаказами();
	ЗначениеВДанныеФормы(докОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолученныеНаСервере()
	докОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	докОбъект.ОтметитьПринятыеЗаказы();
	ЗначениеВДанныеФормы(докОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолученные(Команда)
	ЗаполнитьПолученныеНаСервере();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура Отписаться(Команда)
	ДополнительныеПараметры = Элементы.Заказы.ВыделенныеСтроки;
	
	
		ОткрытьФорму("Документ.ПотерянныеЗаказы.Форма.Форма_РешенияВопроса",
					Новый Структура("ВопросРешен,Комментарий, Посылка, Коробка ,ГруппаЗаказов",
									Элементы.Заказы.ТекущиеДанные.ВопросРешен, 
									Элементы.Заказы.ТекущиеДанные.Комментарий,
									Элементы.Заказы.ТекущиеДанные.Посылка,
									Элементы.Заказы.ТекущиеДанные.Коробка,
									(Элементы.Заказы.ВыделенныеСтроки.Количество()>1)),
					ЭтотОбъект,,,,Новый ОписаниеОповещения("РешитьВопрос_Завершение", ЭтотОбъект,ДополнительныеПараметры),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры



&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДополнительныеПараметры = Элементы.Заказы.ВыделенныеСтроки;
	ОткрытьФорму("Документ.ПотерянныеЗаказы.Форма.Форма_РешенияВопроса",
					Новый Структура("ВопросРешен,Комментарий, Посылка, Коробка ,ГруппаЗаказов",
									Элементы.Заказы.ТекущиеДанные.ВопросРешен, 
									Элементы.Заказы.ТекущиеДанные.Комментарий,
									Элементы.Заказы.ТекущиеДанные.Посылка,
									Элементы.Заказы.ТекущиеДанные.Коробка,
									Ложь),
					ЭтотОбъект,,,,Новый ОписаниеОповещения("РешитьВопрос_Завершение", ЭтотОбъект,ДополнительныеПараметры),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


&НаКлиенте
Процедура РешитьВопрос_Завершение(Результат, ДополнительныеПараметры)  Экспорт
	Если Результат <> Неопределено Тогда
		Для каждого пн из ДополнительныеПараметры Цикл
			элем = Объект.Заказы[пн];
			ЗаполнитьЗначенияСвойств(элем, Результат);	
			элем.ДатаКомментария 	= ТекущаяДата();
			элем.Выгружать 			= (Результат.Комментарий <> "");
			элем.Отправлено 		= Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры


&НаСервере
Функция  ПросмотрXMLНаСервере()
	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	Возврат СтоСПОбмен_ПотерянныеЗаказы_lostOrder.СкомпоноватьДляВыгрузки(об);
КонецФункции



&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);

КонецПроцедуры



&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	ОтправитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об	=	ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	об.ВыгрузитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповестить("ЗакрытПотерянныеЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура НакладныеПриАктивизацииСтроки(Элемент)
	Если Элемент.текущиеДанные	= неопределено Тогда Возврат; КонецЕсли;
	Элементы.Заказы.ОтборСтрок	= новый ФиксированнаяСтруктура("НомерНакладной, ДатаНакладной, ПунктВыдачи",
																Элемент.текущиеДанные.НомерНакладной,
																Элемент.текущиеДанные.ДатаНакладной,
																Элемент.текущиеДанные.ПунктВыдачи);
	Элементы.ЗаказыНомерНакладной.Видимость = Ложь;
	Элементы.ЗаказыДатаНакладной.Видимость = Ложь;
	Элементы.ЗаказыПунктВыдачи.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура 	ПоказатьВсе(Команда)
	Элементы.Заказы.ОтборСтрок	= Неопределено;
	Элементы.ЗаказыНомерНакладной.Видимость = Истина;
	Элементы.ЗаказыДатаНакладной.Видимость = Истина;
	Элементы.ЗаказыПунктВыдачи.Видимость = Истина;

КонецПроцедуры
